// let test1 = function (howManyTimes, whatToDraw) {

//     for (i = 0; i < howManyTimes; i++) {
//         console.log(i + " " + whatToDraw);
//     }


// };

// test1(5, 'fsdfs');

// вывод в консоль указанного рисунка/буквы, указанное кол-во раз
// ----------------------------------------------------------------------------------------------

// let test = function (name) {
//     if (name.length < 5) {
//         return;
//     }
//     return 'пятая буква вашего имени:' + name[4] + '.';
// };



// console.log(test('Николай'));

// выведет 5ю букву введенного имени, если его длина больше 5
// ------------------------------------------------------------------------------------------------------

// var headEl = document.getElementById("main-heading");

// var tester = prompt('введите новый заголовок:');

// headEl.innerHTML = tester;


// смена текста в указанном теге
// --------------------------------------------------------------------------------


// var tester = prompt('введите новый заголовок:');
// $('#main-heading').text(tester);

// смена текста с помощью jquerry
// ------------------------------------------------------------------------------


// $('body').append('<p>Это текс добавленный с помощью jquery</p>');

// добавить тег в дерево 
// ----------------------------------------------------------------------------------



// for (i = 0; i < 3; i++) {
//     var hobby = prompt('Укажите одно из своих хобби');
//     $('body').append('<p>' + hobby + '</p>');
// }

// добавить по-очереди свои хобби jquerry
// --------------------------------------------------------------------------------------------

// $('h1').fadeOut(3000);



// заголовки постепенно исчезают
// -------------------------------------------------------------------------------------


// $('h1').text('текст скоро исчезнеэ').fadeOut(3000);


// --------------------------------------------------------------------------------------
$('h1').slideUp(1000).slideDown(1000);